		if(typeof String.prototype.trim !== 'function') {
			String.prototype.trim = function() { return this.replace(/^\s+|\s+$/g, ''); }
		}
/*! ###################### Question for 39F ##############################*/
		function cho_hangul(str) {
			cho = ["ㄱ","ㄲ","ㄴ","ㄷ","ㄸ","ㄹ","ㅁ","ㅂ","ㅃ","ㅅ","ㅆ","ㅇ","ㅈ","ㅉ","ㅊ","ㅋ","ㅌ","ㅍ","ㅎ"];
			result = "";
			for(i=0;i<str.length;i++) {
				code = str.charCodeAt(i)-44032;
				if(code>-1 && code<11172)
					result += cho[Math.floor(code/588)];
				else
					result += str.substring(i, i+1);
			}
			return result;
		}
		var db_39=[{"q":"下列哪個非為楓之谷中存在的製作材料?","a1":"炎魔的眼淚","a2":"紫水晶的母礦","a3":"貓眼石","a4":"迷魂湯的","a":"1"},{"q":"下列中哪個為非楓之谷中存在的製作材料?","a1":"充滿愛的巧克力","a2":"退色銀的母礦","a3":"A","a4":"馬鬱蘭花哦日","a":"1"},{"q":"下列中哪個為非楓之谷中存在的製作材料?","a1":"茉莉花的種子","a2":"樹叢騎士母礦","a3":"鋼鐵","a4":"的護身符死了","a":"2"},{"q":"下列中哪個為非楓之谷中存在的製作材料？","a1":"藥草瓶","a2":"阿嬤花種子","a3":"動物的皮","a4":"(愛幕愛慕furball的)","a":"2"},{"q":"下列中哪個為非風之谷中存在的製作材料？","a1":"快樂鼠尾草","a2":"梅格耐斯的汗淚珠","a3":"低磨蝕性","a4":"你錐鴨","a":"1"},{"q":"下列中那個非為楓之谷中存在的材料？","a1":"牛膝花草的花 ","a2":"終極模具家 ","a3":"精靈沙漠 ","a4":"的魔粉","a":"3"},{"q":"下列中那個非為楓之谷中存在的材料？","a1":"杜松的花 ","a2":"鑽石母礦 ","a3":"使用過的模具 ","a4":"體力恢復藥水","a":"3"},{"q":"下列中哪個非楓之谷中存在的製做材料？","a1":"廣藿香的花 ","a2":"(智慧的水晶 母礦) ","a3":"藥水混凝劑 ","a4":"葫蘆汁 ","a":"4"},{"q":"下列中哪個非楓之谷中存在的製作材料？","a1":"茶樹的種子 ","a2":"鋰礦的母礦 ","a3":"藍寶石 ","a4":"青黴素 ","a":"4"},{"q":"下列中哪個為非楓之谷中存在的製作材料？","a1":"洋甘菊的花 ","a2":"鋰的母礦 ","a3":"力量藥水的 ","a4":"鎳 ","a":"4"},{"q":"下列中哪個非火砲？","a1":"(巴克斯D)","a2":"電擊加農砲","a3":"(藝術reolri)","a4":"科拉灣萊昂攻城炮","a":"1"},{"q":"下列中哪個非火砲？","a1":"幸福雪白加農砲","a2":"閃亮鋼鐵加農砲","a3":"我的明星消除","a4":"斯嘉麗消除","a":"2"},{"q":"下列中哪個非火炮？","a1":"無聲加農砲","a2":"附魔綠寶石加農炮","a3":"鐵轟炸機","a4":"擊日鞋子炸彈","a":"2"},{"q":"下列中哪個非火砲？","a1":"攔路者","a2":"巴洛古的萊諾","a3":"松玩具加??農砲","a4":"俠客圖斯芙蘭火箭筒","a":"3"},{"q":"下列中哪個非火砲？","a1":"地獄消除","a2":"混沌火焰噴射器","a3":"露露藝術","a4":"酒莊源","a":"3"},{"q":"下列中哪個非火炮？","a1":"地獄消除","a2":"巴洛古的萊諾","a3":"詛咒的黑加農炮","a4":"混沌火焰噴射器","a":"3"},{"q":"下列中哪個非火砲？","a1":"龍紋火箭筒","a2":"楓之谷綠寶石加農砲","a3":"拽尼克‧萊諾","a4":"酒莊源","a":"3"},{"q":"下列中哪個非火砲？","a1":"夫尼爾加農火砲","a2":"妖精的普洛斯提萊諾","a3":"颱風消除","a4":"模糊李加農砲","a":"4"},{"q":"下列中哪個非火砲？","a1":"帝國護衛火炮","a2":"(終極消除)","a3":"博通地獄消除","a4":"(特製yigeunayi在撞車)","a":"4"},{"q":"下列中哪個非單手武器？","a1":"封魂之槌","a2":"米哈逸","a3":"渾沌弗勞德","a4":"普通","a":"1"},{"q":"下列中哪個非單手武器？","a1":"先驅者的戰槌","a2":"勇氣的翅膀","a3":"傳奇弗勞德","a4":"維京劍","a":"1"},{"q":"下列中哪個非單手武器？","a1":"魔靈之魂","a2":"樹木槌","a3":"雷鞭","a4":"阿爾法平面","a":"2"},{"q":"下列中哪個非單手武器？","a1":"特製赤斧","a2":"勇猛的翅膀","a3":"叢枝的","a4":"金輝寶寶擊","a":"2"},{"q":"下列中哪個非單手武器？","a1":"楓之谷紀念旗","a2":"新月刃","a3":"(EO是)","a4":"深淵的圖片搜索者","a":"3"},{"q":"下列中哪個非單手武器？","a1":"雙刃斧","a2":"幸福雪白劍","a3":"先驅者的雙翅膀","a4":"模糊的記憶","a":"3"},{"q":"下列中哪個非單手武器？","a1":"(真‧楓葉巨傘)","a2":"閃光擊","a3":"語句榮耀","a4":"永恆winteoreo","a":"3"},{"q":"下列中哪個非單手武器？","a1":"混沌猛禽斧","a2":"革命之劍","a3":"特製三叉戟","a4":"瓦倫蒂的語言","a":"3"},{"q":"下列中哪個非單手武器？","a1":"湯勺","a2":"火焰刀","a3":"日密月","a4":"(geuryunhil)","a":"4"},{"q":"下列中哪個非單手武器？","a1":"缺愛劊子手","a2":"楓葉綠寶石提供者","a3":"搜索","a4":"(hogeom)","a":"4"},{"q":"下列中非存在於楓之谷中的椅子為？","a1":"(3月兔子椅子)","a2":"(月亮星星抱枕椅)","a3":"鑽手錶椅子","a4":"愛心椅子","a":"1"},{"q":"下列中非存在於楓之谷中的椅子為？","a1":"回到我身邊椅子","a2":"麻糬冰淇淋椅","a3":"釋夢椅子","a4":"公會椅子","a":"1"},{"q":"下列中非存在於楓之谷中的椅子為？","a1":"粉紅色海狗沙發","a2":"警長晚年椅子","a3":"黛比約翰椅子","a4":"痊癒10週椅子","a":"2"},{"q":"下列中非存在於楓之谷中的椅子為？","a1":"輕鬆椅子","a2":"猛?椅子","a3":"吉拉的GETTT美容","a4":"野外露營生火椅子","a":"2"},{"q":"下列中非存在於楓之谷中的椅子為？","a1":"愛的椅子","a2":"粉紅海灘遮陽椅","a3":"瓦倫西亞擊椅子的的詛咒","a4":"夢想的畫家椅子","a":"3"},{"q":"下列中非存在於楓之谷中的椅子為？","a1":"樹木浴缸","a2":"紅色設計椅","a3":"輪椅","a4":"撈叨朋友椅子","a":"3"},{"q":"下列中非存在於楓之谷中的椅子為？","a1":"貴族椅子","a2":"堅固的椅子","a3":"兔子椅子","a4":"金錢墊子","a":"4"},{"q":"下列中非存在於楓之谷中得椅子為？","a1":"狐狸雨椅子","a2":"柿子樹鞦韆","a3":"小熊床","a4":"追擊的柿子樹椅子","a":"4"},{"q":"下列中非存在於楓之谷中的椅子為？","a1":"楓樹下","a2":"熱帶夏季穿","a3":"龍的認識","a4":"初戀的純情椅子","a":"4"},{"q":"下列中非存在於楓之谷中的椅子為？","a1":"水管椅子","a2":"月妙抱枕椅","a3":"(Soul'll椅子)","a4":"鑽石浴缸","a":"4"},{"q":"下列中哪個為非消耗道具？","a1":"法師的粉藥","a2":"紅色藥水","a3":"的飛躍獲得的財富","a4":"凌晨的露珠","a":"1"},{"q":"下列中哪個為非消耗道具？","a1":"巴克斯D","a2":"橘色藥水","a3":"的飛躍積累的經驗","a4":"雞蛋","a":"1"},{"q":"下列中哪個為非消耗道具？","a1":"白色藥水","a2":"精靈的露珠","a3":"無敵的飛躍","a4":"傳家密藥","a":"2"},{"q":"下列中哪個為非消耗道具？","a1":"藍色藥水","a2":"溫果汁","a3":"覺醒的飛躍","a4":"傳奇後勁的飛躍","a":"2"},{"q":"下列中哪個為非消耗道具？","a1":"疼痛舒緩劑","a2":"紅色藥水藥丸","a3":"gapohnyeon耐心的飛躍","a4":"巨人的飛躍","a":"3"},{"q":"下列中哪個為非消耗道具？","a1":"速度藥丸","a2":"特殊","a3":"炎魔的呼吸","a4":"耐心的飛躍","a":"3"},{"q":"下列中哪個為非消耗道具？","a1":"特殊密藥","a2":"(十字獵人魔法攻擊力藥水)","a3":"(覺醒的gaqpohnyeon飛躍)","a4":"彩虹之星藥水","a":"3"},{"q":"下列中哪個為非消耗道具？","a1":"天使的腳步","a2":"(超值藥水)","a3":"特殊生命回复藥水","a4":"黨的奶酪","a":"4"},{"q":"下列中哪個為非消耗道具？","a1":"乳酪","a2":"幸運的藥丸","a3":"艱鉅的飛躍的韓福","a4":"紫色藥水","a":"4"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"火鳳凰的羽毛","a2":"次元手套","a3":"破解眼鏡","a4":"無情杜丹","a":"1"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"糖果的料理帽子","a2":"藍色伯爵靴","a3":"(HONTE日的項鍊)","a4":"臭鼬的防毒面具","a":"1"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"防禦的達人","a2":"煉金術師的首席手套","a3":"黑羅勒的靴子","a4":"炎魔的間距","a":"2"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"杰德日出環","a2":"米諾特烏魯斯鼻環","a3":"火的毀滅法老的腰帶","a4":"玫瑰花耳環","a":"2"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"混沌粉紅帽子","a2":"最終半盔","a3":"協奏曲","a4":"鴨子潛泳的","a":"2"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"颱風肩章","a2":"終極戒指","a3":"收到的太陽鏡恩典","a4":"布朗雙德靴子","a":"3"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"紅色時髦耳環","a2":"暴君之城強盜腰帶","a3":"混亂的藥水","a4":"絕望的毛腳","a":"4"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"火焰之弓","a2":"雷閃火擊","a3":"雪白芬尼伯爵","a4":"毒蛇毒液","a":"4"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"綠色腰帶","a2":"俠客圖斯芙蘭火箭筒","a3":"紅色的六翼天使披風顏色","a4":"的魔咒被包含在聯軸器單飛","a":"4"},{"q":"下列中不存在於楓之谷裡的道具為？","a1":"龍紋披風","a2":"天使祝福","a3":"糖果的小棒","a4":"紫色亞麻水手頭巾","a":"3"},{"q":"下列中沒有在楓之谷裡登場過的BOSS怪物為？","a1":"鈣質","a2":"魔王巴洛古","a3":"斑斑","a4":"綠野仙?","a":"1"},{"q":"下列中沒有在楓之谷裡登場過的BOSS怪物為？","a1":"菩提蔡麗","a2":"班班","a3":"無","a4":"梅格耐斯","a":"1"},{"q":"下列中沒有在楓之谷裡登場過的BOSS怪物為？","a1":"大哥","a2":"夢幻龍族","a3":"增強毒傀儡","a4":"血腥女王","a":"1"},{"q":"下列中沒有在楓之谷裡登場過的BOSS怪物為？","a1":"貝魯加墨特","a2":"怪蛇","a3":"範萊昂","a4":"希拉","a":"2"},{"q":"下列中沒有在楓之谷裡登場過的BOSS怪物為？","a1":"薛西斯","a2":"六手邪神","a3":"抗蛇毒","a4":"天鵝皇后","a":"3"},{"q":"下列中沒有再楓之谷裡登場過的BOSS怪物為？","a1":"杜那斯","a2":"龍騎士","a3":"鴯?弧","a4":"皮埃爾","a":"3"},{"q":"下列中沒有在楓之谷裡登場過的BOSS怪物為？","a1":"斑斑","a2":"海軍艦長","a3":"紅她媽的的緣故","a4":"鷹眼","a":"4"},{"q":"下列中沒有在楓之谷裡登場過的BOSS怪物為？","a1":"尼貝隆根戰艦","a2":"爆裂之槌","a3":"伊卡勒特","a4":"夢幻龍族","a":"2"},{"q":"下列中沒有在楓之谷裡登場過的BOSS怪物為？","a1":"搖滾精神","a2":"暗黑武士","a3":"佩倫","a4":"神獸","a":"2"},{"q":"下列中沒有在楓之谷裡登場過的BOSS怪物為？","a1":"奧芙赫班","a2":"雷克斯","a3":"該莉納亞","a4":"熊rilseu九","a":"4"},{"q":"下列中哪個為非惡魔型怪物？","a1":"不良學生","a2":"剛剛交往的菇菇情侶","a3":"去告白的柔道熊貓","a4":"傑克澳燈籠","a":"1"},{"q":"下列中哪個為非精靈型怪物？","a1":"蝸牛","a2":"精靈","a3":"(橙色T)","a4":"寶寶熊飲食石頭","a":"1"},{"q":"下列中哪個為非植物型怪物？","a1":"喇叭花花盆","a2":"百烈玉兔","a3":"綠菇菇","a4":"溫暖","a":"2"},{"q":"下列中哪個為非魚類型怪物？","a1":"青螃蟹","a2":"黑色法師的翼龍","a3":"扭結蘭","a4":"皮亞劍鋒","a":"2"},{"q":"下列中哪個為非無形怪物？","a1":"穆寧","a2":"安全第一","a3":"蝦虎魚","a4":"郁消失","a":"3"},{"q":"下列中哪個為非不死型怪物？","a1":"幽靈","a2":"幽靈","a3":"合格的突突","a4":"殭屍猴王","a":"3"},{"q":"下列中哪個為非無型怪物？","a1":"我叫洋蔥","a2":"艾莉爾","a3":"空章魚消失","a4":"(阿恩angttu下來)","a":"4"},{"q":"下列中哪個為非不死型怪物？","a1":"殭屍魔菇王","a2":"燈籠鬼","a3":"殭屍猴王","a4":"粉紅空","a":"4"},{"q":"下列中哪個為非爬蟲類型怪物？","a1":"青蛙","a2":"鱷魚","a3":"強烈韓冷眼","a4":"小幽靈","a":"4"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"衝擊","a2":"粉紅發條熊","a3":"企鵝王","a4":"塊珀斯","a":"1"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"爍展艾伊","a2":"唐尼","a3":"成年仙人掌沙漠","a4":"(BUFFLE魚)","a":"2"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"蝸牛","a2":"黑暗卡魯斯","a3":"藍色機器人","a4":"高放","a":"2"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"小幽靈","a2":"索拉利昂","a3":"赤龍","a4":"(hogeol)","a":"2"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"三眼章魚","a2":"幽魂女巫","a3":"(的Corbie)","a4":"鐮刀","a":"3"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"石巨人","a2":"回憶的神官","a3":"紅辣椒","a4":"紐特小","a":"3"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"石面赤人","a2":"赤翼龍","a3":"(Hubertus酒店)","a4":"薩莉的","a":"3"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"黑肥肥","a2":"貝魯加墨特","a3":"少年印章","a4":"乘坐魔像","a":"4"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"藍菇菇","a2":"花鯰魚","a3":"方塊消失","a4":"大鎚","a":"4"},{"q":"下列中不存在於楓之谷裡的怪物為？","a1":"骷髏犬","a2":"雙刀龍戰士","a3":"沙漠蛇","a4":"藏紅花","a":"4"},{"q":"站在沉睡森林的飯店門口的道具製造者為？","a1":"克利斯拉瑪","a2":"塔利溫","a3":"權達開","a4":"海豚","a":"1"},{"q":"魔法森林的寵物大師名字為？","a1":"妖精瑪莉","a2":"長老斯坦","a3":"妖精佛羅拉","a4":"伊爾斯","a":"1"},{"q":"納希的武器商人名字為？","a1":"渣伊德","a2":"阿依琳","a3":"蕾雅","a4":"歐心馬","a":"1"},{"q":"納希的護膚管理師名字為？","a1":"拉伊拉","a2":"奈倍爾","a3":"黃金厄運死神","a4":"科爾","a":"1"},{"q":"靈藥幻境的精靈幫手名字為？","a1":"鶴","a2":"白鷺","a3":"起重機","a4":"雞","a":"1"},{"q":"守在萬神殿大神前乃乃的名字為？","a1":"賽蓮","a2":"奧利維亞","a3":"內拉","a4":"吉夫","a":"1"},{"q":"瑞恩的倉庫老闆的名字為？","a1":"噗斯拉","a2":"必魯","a3":"休咪","a4":"莉納亞","a":"1"},{"q":"墮落程式的地鐵公益要員名子為？","a1":"阿勒斯","a2":"雄","a3":"義安","a4":"路易士","a":"2"},{"q":"納希的整形外科醫生名字為？","a1":"休咪","a2":"亞丁","a3":"史庫魯基","a4":"赫麗娜","a":"2"},{"q":"勇士之村的武器商人名字為？","a1":"麥克","a2":"利伯","a3":"卡蜜拉","a4":"猶他","a":"2"},{"q":"居住在瑪迦提亞城的仲介商名字為？","a1":"仲介商晶","a2":"仲介商韓","a3":"仲介商弘","a4":"達爾利","a":"2"},{"q":"居住在勇士聖殿的劍士轉職官為？","a1":"瑪帕","a2":"酋長","a3":"漢斯","a4":"索非亞","a":"2"},{"q":"居住在瑪迦提亞城的休曼諾依德的名字為？","a1":"費伊","a2":"(休曼諾依德A)","a3":"(休曼諾依德B)","a4":"(休曼諾依德C)","a":"2"},{"q":"埃德爾斯坦的小熊工讀生名字為？","a1":"千吉","a2":"奇盧","a3":"傑奇","a4":"菲阿萬","a":"3"},{"q":"玩具城的朋友目錄管理者名字為？","a1":"黃金厄運死神","a2":"蒲德拉","a3":"哈利","a4":"克魯索","a":"3"},{"q":"埃德爾斯坦的縣議長名字為？","a1":"休咪","a2":"安培爾","a3":"安索尼","a4":"艾斯達","a":"3"},{"q":"住在黃金海岸度假村的雜貨商人名字為？","a1":"富蘭德里","a2":"美髮師娜塔麗","a3":"梅森","a4":"蓓蒂","a":"3"},{"q":"埃德爾斯坦的前議長名字為？","a1":"葛溫","a2":"卡依琳","a3":"阿貝勒特","a4":"拉尼亞","a":"3"},{"q":"站在黃金寺廟入口的小僧侶名字為？","a1":"土普","a2":"優納米斯","a3":"奴伊","a4":"戴特","a":"3"},{"q":"黃金寺廟的雜貨商人名字為？","a1":"凱利","a2":"奇慕","a3":"唐歡","a4":"丹妮卡","a":"3"},{"q":"埃德爾斯坦的環境美化人員名字為？","a1":"拉爾","a2":"奇里督","a3":"赫力泰","a4":"伊藤","a":"3"},{"q":"玩具城的倉庫老闆名字為？","a1":"羅德斯","a2":"噗洛","a3":"史烏","a4":"(倉庫之地賽飛)","a":"4"},{"q":"鯨魚號的倉庫老闆名字為？","a1":"蘇麗思","a2":"塔古斯","a3":"倫多","a4":"守財奴","a":"4"},{"q":"里艾那海峽冰河觀測本部的舵手名字為？","a1":"湯寶寶","a2":"噗卡","a3":"妖精菲歐納","a4":"舵手塔挐","a":"4"},{"q":"鯨魚號的武器商人名字為？","a1":"麗德","a2":"普蘭西斯","a3":"德斯","a4":"摩根","a":"4"},{"q":"居住在萬神殿的新手商人名字為？","a1":"瞌睡蟲","a2":"噗滋奇","a3":"妖精吾尼","a4":"卡琳","a":"4"},{"q":"鯨魚號的雜貨商人名字為？","a1":"傑克","a2":"肉桂","a3":"寶貝龍","a4":"蓋利","a":"4"},{"q":"維多利亞港的盟友目錄管理者名字為？","a1":"盲俠","a2":"潔兒","a3":"(魔女芭芭拉)","a4":"智慧爺爺","a":"4"},{"q":"下列中哪個為非居住於楓之谷中的居民名字？","a1":"察爾茲","a2":"蕾雅","a3":"蓓蒂","a4":"馬蒂烏斯","a":"1"},{"q":"下列中哪個為非居住於楓之谷中的居民名字？","a1":"阿九夢","a2":"亥勒夏","a3":"伊卡路斯","a4":"富蘭德里","a":"1"},{"q":"下列中哪個為非居住於楓之谷中的居民名字？","a1":"煙霧","a2":"卡珊德拉","a3":"賽恩","a4":"蕾雅","a":"1"},{"q":"下列中哪個為非居住於楓之谷中的居民名字？","a1":"必魯","a2":"卡諾","a3":"馬蒂達","a4":"黃金厄運死神","a":"2"},{"q":"下列中哪個為非居住於楓之谷中的居民名字？","a1":"衝擊","a2":"塞維利亞","a3":"(keulriang)","a4":"內拉","a":"2"},{"q":"下列中哪個為非居住於楓之谷中得居民名字？","a1":"賽蓮","a2":"杰奎琳","a3":"倉庫管理員樸先生","a4":"權達開","a":"2"},{"q":"下列中哪個為非居住於楓之谷中居民名字？","a1":"班德","a2":"皮亞","a3":"DJ區","a4":"海豚","a":"3"},{"q":"下列中哪個為非居住於楓之谷中的居民名字？","a1":"長老斯坦","a2":"克拉拉","a3":"(kayijo)","a4":"蕾雅","a":"3"},{"q":"下列中哪個為非居住於楓之谷中的居民名字？","a1":"阿依琳","a2":"奈倍爾","a3":"巨人喬","a4":"史庫魯基","a":"3"},{"q":"下列中哪個為非居住在楓之谷中的居民名字？","a1":"塔利溫","a2":"齊克","a3":"篤伊","a4":"十字繡","a":"4"},{"q":"是誰的台詞？-哼你也要試試看得道的訓練嗎？","a1":"盧公","a2":"道公","a3":"奇翁","a4":"裘老頭","a":"1"},{"q":"是誰的台詞？-滄海桑田...隨著歲月的流逝這個世界也變得很多","a1":"道公","a2":"奇翁","a3":"裘老頭","a4":"盧公","a":"1"},{"q":"是誰的台詞？-作業又多又需要唸書...好忙...","a1":"(妖精維英)","a2":"(妖精艾溫)","a3":"(妖精傑克)","a4":"(妖精羅雯)","a":"1"},{"q":"是誰的台詞？-漢斯雖然不是壞人..","a1":"妖精艾溫","a2":"盲俠","a3":"蒲德拉","a4":"(妖精蘇)","a":"1"},{"q":"是誰的台詞？-朋友艾溫造成人們的不便","a1":"(妖精羅雯)","a2":"阿依琳","a3":"妖精維英","a4":"(妖精噗靈)","a":"1"},{"q":"是誰的台詞？-似乎在蒐集藥草...","a1":"薩比特拉瑪","a2":"必魯","a3":"奇里督","a4":"羅德斯","a":"1"},{"q":"是誰的台詞？-我得趕快想辦法把草要拿給太常..","a1":"裘老頭","a2":"金老頭","a3":"朴老頭","a4":"趙老頭","a":"1"},{"q":"是誰的台詞？-手已經不如以前了..如過能趕快有一名弟子就好了..","a1":"奇翁","a2":"李翁","a3":"金老頭","a4":"裘老頭","a":"1"},{"q":"是誰的台詞?-看的見前面嗎？理所當然的式為什麼要問？","a1":"佩森","a2":"噗諾暈","a3":"噗卡","a4":"索菲亞","a":"2"},{"q":"是誰的台詞？-天氣很好吧?是適合散步的好天氣","a1":"科爾","a2":"凱雷特","a3":"肉桂","a4":"阿勒斯","a":"2"},{"q":"是誰的台詞？-最近怪物們好像變兇殘的樣子，真擔心","a1":"科爾","a2":"麗莎","a3":"噗滋奇","a4":"吉米","a":"2"},{"q":"是誰的台詞？-雖然工作重要，但吃好吃的東西也很重要","a1":"歐心馬","a2":"帕潘","a3":"普蘭西斯","a4":"艾斯達","a":"2"},{"q":"是誰的台詞？-自己玩好無聊...呼~","a1":"吉夫","a2":"搬運暴龍","a3":"噗洛","a4":"猶他","a":"2"},{"q":"是誰的台詞？–如果有惡魔文件就交給我保管如何？","a1":"休曼諾伊德C","a2":"吉妮","a3":"麗德","a4":"休咪","a":"2"},{"q":"是誰的台詞？–他旁邊的迪布常常說很厭倦守衛工作","a1":"達爾利","a2":"果伸","a3":"傑克","a4":"葛溫","a":"2"},{"q":"是誰的台詞？-不會原諒偷東西的人的！","a1":"伊爾斯","a2":"海里","a3":"潔兒","a4":"路易士","a":"2"},{"q":"是誰的台詞？-要集合大家的力量才行？","a1":"莉納亞","a2":"拉凱里斯","a3":"塔古斯","a4":"蓓蒂","a":"2"},{"q":"是誰的台詞？-最近怪物們好像變兇殘的樣子，真擔心","a1":"科爾","a2":"麗莎","a3":"噗滋奇","a4":"吉米","a":"2"},{"q":"是誰的台詞？-我是適合圍裙的男人","a1":"赫麗娜","a2":"日雷克斯","a3":"克魯索","a4":"富蘭德里","a":"2"},{"q":"是誰的台詞？-看看我的肌肉，不想變得跟我一樣強嗎？","a1":"吉米","a2":"穆內","a3":"坤","a4":"德斯","a":"2"},{"q":"是誰的台詞？-要讓海水面的上升停下來才行..","a1":"杜賓犬","a2":"休咪","a3":"噗仔","a4":"千吉","a":"3"},{"q":"是誰的台詞？-需要堅固的防具的話要不要暫時進來這邊看看？","a1":"路易士","a2":"麥克","a3":"羅德斯","a4":"寶貝龍","a":"3"},{"q":"是誰的台詞？–正在迎接古代諾吧的神","a1":"索非亞","a2":"仲介商晶","a3":"衝擊","a4":"倫多","a":"3"},{"q":"是誰的台詞？–嗅嗅...這是什麼味道？","a1":"猶他","a2":"費依","a3":"亞皮歐拉","a4":"魔女芭芭拉","a":"3"},{"q":"是誰的台詞？–哼，就說了完全無法再信任外部的人","a1":"拉尼亞","a2":"阿勒斯","a3":"土普","a4":"校監卡啦洋","a":"4"},{"q":"是誰的台詞？-我軍生火的燃料不足","a1":"伊藤","a2":"休咪","a3":"羅德斯","a4":"高羅","a":"4"},{"q":"是誰的台詞？-咦...？我的研究資料去哪了？","a1":"艾斯達","a2":"傑斐","a3":"凱利","a4":"魔法師庫迪","a":"4"},{"q":"是誰的台詞？-放鬆身體才沒多過多久","a1":"戴特","a2":"蘭","a3":"瞌睡蟲","a4":"達菲","a":"4"},{"q":"是誰的台詞？-海道士最強的！來比一盤吧！","a1":"蓓蒂","a2":"瑪帕","a3":"拉爾","a4":"瓦蕾莉","a":"4"},{"q":"是誰的台詞？-是我撿來的，我來負責！","a1":"菲阿萬","a2":"富蘭德里","a3":"黃金厄運死神","a4":"蘭","a":"4"},{"q":"是誰的台詞？-誰能幫忙弄點吃的來就好了","a1":"丹尼卡","a2":"高羅","a3":"達菲","a4":"土土","a":"4"},{"q":"下列中哪個非在TheSeed中登場的怪物？","a1":"古代紅色烏龜　","a2":"時鐘　","a3":"艾利傑　","a4":"藍色食蟲綠水靈","a":"1"},{"q":"下列中哪個非在TheSeed中登場的怪物？","a1":"穆魯帕　","a2":"棕色刺熊　","a3":"薩莉的　","a4":"紅色沙矮人","a":"1"},{"q":"下列中哪個非在TheSeed中登場的怪物？","a1":"古代藍色烏龜　","a2":"黃色花牛　","a3":"赫克托　","a4":"黃色食蟲綠水靈","a":"2"},{"q":"下列中哪個非在TheSeed中登場的怪物？","a1":"古代橘色烏龜　","a2":"黑色刺熊　","a3":"白牙　","a4":"沙漠蛇","a":"2"},{"q":"下列中哪個非在TheSeed中登場的怪物？","a1":"花巨人　","a2":"青螃蟹　","a3":"藍色菇蝙蝠　","a4":"白刺熊","a":"3"},{"q":"下列中哪個非在Theseed中登場的怪物？","a1":"藍色花牛　","a2":"黃色菇蝙蝠　","a3":"藍色古代甲蟲　","a4":"古代橘色烏龜","a":"3"},{"q":"下列中哪個非在TheSeed中登場的怪物？","a1":"黑色花巨人　","a2":"紅螃蟹　","a3":"古代菇蝙蝠　","a4":"古代藍色烏龜","a":"3"},{"q":"下列中哪個非在TheSeed中登場的怪物？","a1":"魔龍　","a2":"鱷魚　","a3":"古代式電荷消失　","a4":"圍巾蜥蜴","a":"3"},{"q":"下列中哪個非在TheSeed中登場的怪物？","a1":"綠色花牛　","a2":"獨角獅　","a3":"沙漠蛇　","a4":"滾輪","a":"4"},{"q":"下列中哪個非在TheSeed中登場的怪物？","a1":"白刺熊　","a2":"獨角獅　","a3":"圍巾蜥蜴　","a4":"鱷魚","a":"4"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"沉睡森林　","a2":"瑞恩　","a3":"埃德爾斯坦　","a4":"納希","a":"1"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"魔法森林　","a2":"埃德爾斯坦　","a3":"盧克里特島　","a4":"維多利亞港","a":"1"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"瓶子草　","a2":"瑪迦提亞城　","a3":"鯨魚　","a4":"納希","a":"1"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"墮落城市　","a2":"天鵝村　","a3":"勇士之村　","a4":"神木村","a":"2"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"弓箭手村　","a2":"板橋　","a3":"墮落城市　","a4":"靈藥幻境","a":"2"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"耶雷弗　","a2":"奇幻村　","a3":"大蕾雅牙　","a4":"墮落城市","a":"3"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"勇士之村　","a2":"武陵　","a3":"勃肯擊蘭的節目　","a4":"櫻花處","a":"3"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"天空之城　","a2":"水之都　","a3":"墮落城市　","a4":"魔法森林","a":"3"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"維多利亞港　","a2":"天空之城　","a3":"靈藥幻境　","a4":"(AqUAAqUA)","a":"4"},{"q":"下列中不存在於楓之谷裡的都市為？","a1":"六條岔道　","a2":"冰原雪域　","a3":"玩具城　","a4":"瑪格麗特","a":"4"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"鬼神之擊　","a2":"黃色潛水艇　","a3":"打火之一　","a4":"米海爾演唱會廳","a":"1"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"洞穴家　","a2":"海產食堂　","a3":"櫻花處家　","a4":"鋼琴","a":"1"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"基地　","a2":"餅乾房屋　","a3":"紅菇菇家　","a4":"烏冬面家","a":"1"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"萬神殿神殿　","a2":"綠洲　","a3":"粉紅天使房屋　","a4":"鯨魚號碼頭","a":"1"},{"q":"下列中飛在怪物生命中登場的建築物？","a1":"菇菇礦山　","a2":"(藍色3段菇菇家)　","a3":"風車　","a4":"水晶花園","a":"1"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"黑色家　","a2":"果實商店　","a3":"萬神殿家　","a4":"(2層新屋)","a":"1"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"水世界貝殼家　","a2":"試鏡心靈廳　","a3":"納希家　","a4":"神獸的窩","a":"2"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"天然冰水家　","a2":"俱樂部弓箭手村　","a3":"櫻花處家　","a4":"玩具城玩具家","a":"2"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"綠菇菇家　","a2":"黑色兔子農場　","a3":"武器商店　","a4":"聖誕老公公的家","a":"2"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"弓箭手村家　","a2":"養殖場　","a3":"驚喜盒家　","a4":"克拉客房屋","a":"2"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"(9周年活動廳)　","a2":"武陵理髮師　","a3":"海洋水族館水族水產區　","a4":"水世界住宅","a":"3"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"彈力彈力葡萄農場　","a2":"瑞恩熱　","a3":"天然赭石家　","a4":"耶雷弗噴水庭園","a":"3"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"草屋　","a2":"粉紅天使房屋　","a3":"楓之谷水上樂園　","a4":"瑞恩冰窖椅","a":"3"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"菇菇寶貝家　","a2":"桃花房屋　","a3":"狂怒厄爾尼諾家　","a4":"武陵修練場","a":"3"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"朱朱牛奶農場　","a2":"浮城　","a3":"壽司店　","a4":"天空之城飛行庭園","a":"3"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"韓愈家　","a2":"(24小時醫院)　","a3":"地下修練場　","a4":"炎魔的洞穴","a":"3"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"弓箭手村弓箭手公會　","a2":"幽靈的家　","a3":"烏冬面家　","a4":"女皇的修道院","a":"4"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"遊樂園海盜船　","a2":"家氣球的驚喜箱　","a3":"驚喜盒家　","a4":"邪摩斯倉庫","a":"4"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"樵夫的家　","a2":"納希家　","a3":"埃德爾斯坦飛行場　","a4":"楓之谷水上房屋","a":"4"},{"q":"下列中非在怪物生命中登場的建築物？","a1":"紅色磚瓦家　","a2":"蘑菇王國前哨　","a3":"馬戲團　","a4":"果樹院","a":"4"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"昏厥的禱告　","a2":"戰士精通　","a3":"恢復民族　","a4":"立場","a":"1"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"條令　","a2":"守護盔甲　","a3":"閃電之棍　","a4":"高級之棍","a":"1"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"自身強化　","a2":"追擊　","a3":"作戰命令的　","a4":"聖騎士專家","a":"2"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"騎士衝擊波　","a2":"武神防禦　","a3":"究極突刺　","a4":"楓之谷勇士","a":"2"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"終極攻擊　","a2":"業領　","a3":"速度激發　","a4":"鬼神之擊","a":"3"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"體能訓練　","a2":"盾防精通　","a3":"富豪拉伸　","a4":"勇士的意志","a":"3"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"戰士縱橫　","a2":"火牢術之棍　","a3":"閃電行動　","a4":"神之棍","a":"3"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"武器精通　","a2":"寒冰之棍　","a3":"小敏抓塊　","a4":"爆炸","a":"3"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"終極攻擊　","a2":"寒冰之劍　","a3":"神之滅擊　","a4":"騎士衝擊波","a":"3"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"精神儲值　","a2":"武神防禦　","a3":"威脅　","a4":"祝福","a":"4"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"極速武器　","a2":"祝福護甲　","a3":"參數衝擊衛士　","a4":"神州劍","a":"4"},{"q":"下列中哪個為非屬於聖騎士的技能？","a1":"劍氣縱橫","a2":"火牢術防禦","a3":"熱","a4":"楓之谷勇士","a":"2"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"(八卦4擊)　","a2":"(神拳2擊)　","a3":"sahon蓋章　","a4":"指虎修練","a":"1"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"(太極2擊)　","a2":"(戰甲拳擊2擊)　","a3":"(gwichan)　","a4":"向後移動","a":"1"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"波動拳擊　","a2":"粉紅派餐　","a3":"楓之谷勇士　","a4":"銷魂鏈","a":"2"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"靈巧跳躍　","a2":"天機推　","a3":"離魂刀斬　","a4":"剛刃絞殺","a":"2"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"狐狸靈　","a2":"束縛術　","a3":"混戰　","a4":"精神的化身","a":"3"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"(通百拳3擊)　","a2":"火狐狸靈　","a3":"(穆德的teomping字廳)　","a4":"(超aekyu火拼)","a":"3"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"肌力鍛鍊　","a2":"(爆流拳4擊)　","a3":"審議yukhap的權利　","a4":"最大化債券條例","a":"3"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"指虎修練　","a2":"幻靈降神　","a3":"超反轉　","a4":"英雄大津的","a":"3"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"消魂帳幕　","a2":"軟肋洞察力　","a3":"跳躍　","a4":"(changyeok)","a":"4"},{"q":"下列中哪個為非屬於隱月的技能？","a1":"減弱　","a2":"(佔領凝聚4式)　","a3":"(geongon日機構)　","a4":"拖鞋廳去","a":"4"},{"q":"下列中哪個為非屬於zero的技能？","a1":"跳躍火力旺　","a2":"臨界綁定　","a3":"前狂刃　","a4":"火力樹樁","a":"1"},{"q":"下列中哪個為非屬於ZERO的技能？","a1":"派特閃神　","a2":"風降臨　","a3":"身體力行　","a4":"刺刀精通","a":"1"},{"q":"下列中哪個為非屬於zero的技能？","a1":"閃耀忍術　","a2":"吹　","a3":"風輪　","a4":"撕心裂肺推力","a":"2"},{"q":"下列中哪個為非屬於zero的技能？","a1":"跳躍消失　","a2":"致命的行動　","a3":"打開驅動器　","a4":"太刀專精","a":"2"},{"q":"下列中哪個為非屬於zero的技能？","a1":"大地衝擊　","a2":"深紅刀　","a3":"滾動曲線　","a4":"躍狂刃","a":"2"},{"q":"下列中哪個為非屬於zero的技能？","a1":"碎地猛擊　","a2":"地獄切割者　","a3":"旋風急轉彎　","a4":"升龍斬","a":"2"},{"q":"下列中哪個為非屬於zero的技能？","a1":"進階旋風急轉彎　","a2":"越線　","a3":"鎧甲分裂　","a4":"幻影降臨","a":"2"},{"q":"下列中哪個為非屬於zero的技能？","a1":"極速切斷　","a2":"神後　","a3":"示?劑通靈　","a4":"投擲","a":"3"},{"q":"下列中哪個為非屬於zero的技能？","a1":"迴旋之刃　","a2":"聖靈裂襲　","a3":"心靈追擊者　","a4":"武器投擲","a":"3"},{"q":"下列中哪個為非屬於zero的技能？","a1":"索利德體身　","a2":"暴風射擊　","a3":"雙重拉伸　","a4":"月降臨","a":"3"},{"q":"下列中哪個為非屬於zero的技能？","a1":"恢復　","a2":"風刀　","a3":"免疫屏障　","a4":"躍擊","a":"4"},{"q":"下列中哪個為非屬於zero的技能？","a1":"投擲　","a2":"(GB死機)　","a3":"大地衝擊　","a4":"驅動文件","a":"4"},{"q":"下列中使用米哈逸的技能無法移動的東西為？","a1":"靈魂存放　","a2":"靈魂盾牌　","a3":"靈魂敏捷　","a4":"靈魂之刃","a":"1"},{"q":"下列中使用惡魔殺手的技能無法移動的東西為？","a1":"保護色　","a2":"吸血鬼觸摸　","a3":"楓之谷勇士　","a4":"黑暗綁定","a":"1"},{"q":"下列中使用破楓使者鯨靈的技能無法移動的東西為？","a1":"二連箭巫師　","a2":"霸王劍　","a3":"弓箭手精通　","a4":"風暴","a":"1"},{"q":"下列中使用暗夜行者精靈的技能無法移動的東西為？","a1":"璇閃　","a2":"黑暗雷鳥　","a3":"速度激發　","a4":"魔鋼","a":"1"},{"q":"下列中使用鬼魂的技能無法移動的東西為？","a1":"幸運卡牌守護　","a2":"完美感官　","a3":"水性概念　","a4":"閃搬運暴龍普利","a":"2"},{"q":"下列中使用神射手的技能無法移動的東西為？","a1":"射擊術　","a2":"光速神弩　","a3":"月球漫步　","a4":"日rujeon一步","a":"3"},{"q":"下列中使用機甲戰神的技能無法移動的東西為？","a1":"命運攻擊　","a2":"火焰發射　","a3":"加格林射擊　","a4":"雙刃刀","a":"4"},{"q":"下列中使用煉獄巫師技能無法移動的東西為？","a1":"智慧昇華　","a2":"四重攻擊　","a3":"紅色吸血術　","a4":"繪製法力","a":"4"},{"q":"下列中使用砲兵的技能無法移動的東西為？","a1":"炸裂彈　","a2":"精通加農　","a3":"猴子的魔法　","a4":"快速重載","a":"4"},{"q":"下列中屬於諾吧的職業為？","a1":"凱澤　","a2":"聖魂劍士　","a3":"米哈逸　","a4":"精靈遊俠","a":"1"},{"q":"下列中屬於諾吧的職業為？","a1":"天使巴斯特　","a2":"聖騎士　","a3":"神射手　","a4":"影子的語言","a":"1"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"幻影精通　","a2":"機甲戰神　","a3":"幻影俠盜　","a4":"加農炮射擊遊戲","a":"1"},{"q":"下列中屬於冒險家的職業為？","a1":"聖魂劍士　","a2":"龍魔導士　","a3":"傑諾　","a4":"雙刃","a":"4"},{"q":"下列中屬於冒險家的職業為？","a1":"狂豹獵人　","a2":"主教　","a3":"幻影俠盜　","a4":"守護復仇者","a":"2"},{"q":"下列中屬於皇家騎士團的職業為？","a1":"天使巴斯特　","a2":"夜行者　","a3":"狂狼勇士　","a4":"守護者巴菲","a":"2"},{"q":"下列中屬於英雄的職業為？","a1":"大魔島士(火毒)　","a2":"夜使者　","a3":"精靈遊俠　","a4":"箭神","a":"3"},{"q":"下列中屬於英雄的職業為？","a1":"煉獄巫師　","a2":"黑騎士　","a3":"夜光　","a4":"大法師(冰閃電)","a":"3"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"惡魔復仇者　","a2":"神射手　","a3":"寶物獵人　","a4":"夜使者","a":"3"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"英雄　","a2":"烈焰巫師　","a3":"舞王　","a4":"聖魂劍士","a":"3"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"黑騎士　","a2":"煉獄巫師　","a3":"(加農炮peonchyro)　","a4":"狂狼勇士","a":"3"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"大魔導士(冰雷)　","a2":"精靈遊俠　","a3":"藝術設計師　","a4":"雙刃","a":"3"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"主教　","a2":"夜使者　","a3":"影子的語言　","a4":"地下城主","a":"4"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"大魔導士(火毒)　","a2":"狂豹獵人　","a3":"隊長　","a4":"亡靈法師","a":"4"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"聖騎士　","a2":"龍魔導士　","a3":"夜行者　","a4":"風亞軍","a":"4"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"米哈逸　","a2":"破風使者　","a3":"毒蛇　","a4":"質量日","a":"4"},{"q":"下列中不存在於楓之谷裡的職業為？","a1":"惡魔殺手","a2":"箭神","a3":"雙刃","a4":"前鋒","a":"1"},{"q":"下列中屬於末日反抗軍的職業為？","a1":"凱澤　","a2":"天使討伐者　","a3":"主教　","a4":"守護復仇者","a":"1"},{"q":"下列中屬於末日反抗軍的職業為？","a1":"英雄　","a2":"夜使者　","a3":"夜行者　","a4":"傑諾","a":"1"},{"q":"下列中哪個非火砲？","a1":"手槍消除","a2":"附魔火砲","a3":"紅加農炮","a4":"絕代細胞觀察","a":"1"},{"q":"居住在墮落城市的道具製作者名字為？","a1":"傑斐","a2":"後街的吉姆","a3":"史密斯","a4":"吉米","a":"2"}];
		function apply39find(obj){
			if(obj.old_value == obj.value) return;
			obj.old_value = obj.value;
			var regex = /([\s<>\\\/])/gi;
			var txt=$(obj).val().trim().replace(regex, '').replace(/ㄳ/g,"ㄱㅅ").replace(/ㄵ/g,"ㄴㅈ").replace(/ㄶ/g,"ㄴㅎ").replace(/ㄺ/g,"ㄹㄱ").replace(/ㄻ/g,"ㄹㅁ").replace(/ㄼ/g,"ㄹㅂ").replace(/ㄽ/g,"ㄹㅅ").replace(/ㄾ/g,"ㄹㅌ").replace(/ㄿ/g,"ㄹㅍ").replace(/ㅀ/g,"ㄹㅎ").replace(/ㅄ/g,"ㅂㅅ");
			$("#q_39_1").children().not(".template").remove();
			if(txt=="") return;
			var txtcho=cho_hangul(txt).split(",");
			txt=txt.split(",");
			$.each(db_39, function(key, val){
				var newval=new Object();
				var used=[];
				$.each(val, function(key2, val2){
					var txtIndex;
					var val2_copy = val2;
					for(var i=0; i<txt.length; i++){
						var val2_trim=val2_copy.replace(regex, '');
						if((txtIndex=val2_trim.indexOf(txt[i])) != -1 || (txtIndex=cho_hangul(val2_trim).indexOf(txtcho[i])) != -1){
							var result;
							var p1=val2_trim.substring(0, txtIndex);
							var p2=val2_trim.substring(txtIndex, txtIndex+txt[i].length);
							var p3=val2_trim.substring(txtIndex+txt[i].length);
							while (result = regex.exec(val2_copy)) {
								if(result.index < p1.length){
									p1=p1.substring(0, result.index) + result[1] + p1.substring(result.index);
								} else if(result.index < p1.length+p2.length){
									p2=p2.substring(0, result.index-p1.length) + result[1] + p2.substring(result.index-p1.length);
								}else{
									p3=p3.substring(0, result.index-p1.length-p2.length) + result[1] + p3.substring(result.index-p1.length-p2.length);
								}
							}
							val2_copy = p1 + "<span class='highlight'>" + p2 + "</span>" + p3;
							used[i]=true;
						}
					}
					newval[key2] = val2_copy;
				});
				if($("#q_39_1").children().length > 8) return true;
				for(i=0; i<txt.length && used[i]; i++);
				if(i==txt.length){
					var obj=$("#q_39_1").find(".template").clone().removeClass("template").css("display", "block");
					$.each(val, function(key2, val2){
						obj.find("."+key2).html(newval[key2]?newval[key2]:val[key2]);
					});
					obj.find(".al"+val.a).addClass("rightanswer");
					$("#q_39_1").append(obj);
				}
				delete newval;
				delete used;
			});
		}
		$(function() {
			$(".increasing").each(function(){
				var obj = $("<span style='float:right'><button onclick='return decrease($(this));'>-</button></span>");
				var par = $(this).parent();
				obj.insertAfter(this);
				$(this).detach();
				obj.append(this).append("<button onclick='return increase($(this));'>+</button>");
			});
			var changecolor=function(aa){
				if(!aa) aa=this;
				if(aa.target) aa = aa.target;
				if($(aa).prop("type")=="radio"){
					if($("input[name='" + aa.name + "']:checked").length==0){
						if($(aa).parent().is("label")) aa=$(aa).parent();
						$(aa).parent().addClass("empty");
					}else{
						if($(aa).parent().is("label")) aa=$(aa).parent();
						$(aa).parent().removeClass("empty");
					}
				}else{
					if($(aa).val().length==0)
						$(aa).addClass("empty");
					else
						$(aa).removeClass("empty");
				}
				if($(aa).is("select")){
					$(aa).next().prop("disabled", $(aa).val().length==0);
				}else if($(aa).is("#3q_35_h, #q_35_m, #q_35_s")){
					var t = parseInt($("#q_35_s").val()) || 0;
					t += 60*(parseInt($("#q_35_m").val()) || 0)
					t += 3600*(parseInt($("#q_35_h").val()) || 0)
					$("#q_35_0").val(t);
				}else if($(aa).prop("id").indexOf("q_36_1_")==0){
					var res="";
					for(var i = 1; i<=8; i++){
						if($("input[name='q_36_1_" + i + "']:checked").length==0){
							$("#q_36_disp_" + i).text("");
							res+="?";
						}else{
							var cur=$("input[name='q_36_1_" + i + "']:checked").val();
							if(cur==1) $("#q_36_disp_" + i).text("1 菇菇寶貝");
							if(cur==2) $("#q_36_disp_" + i).text("2 藍寶");
							if(cur==3) $("#q_36_disp_" + i).text("3 緞帶肥肥");
							if(cur==4) $("#q_36_disp_" + i).text("4 綠水靈");
							res+=$("input[name='q_36_1_" + i + "']:checked").val();
						}
					}
					$("#q_36_1").val(res);
					if(res.indexOf("?")>=0)
						$("#q_36_1").addClass("empty");
					else
						$("#q_36_1").removeClass("empty");
				}else if($(aa).prop("id").indexOf("q_26_")==0){
					if($("#q_26_0_0").val().length==0 || $("#q_26_0_1").val().length==0 || $("#q_26_0_2").val().length==0){
						$("#q_26_0").val(0);
						$("#q_36_1").addClass("empty");
					}else{
						var res=parseInt($("#q_26_0_2").val()) - parseInt($("#q_26_0_0").val()) + 10*parseInt($("#q_26_0_1").val())
						$("#q_26_0").val(res);
						$("#q_36_1").removeClass("empty");
					}
				}
				stopPlay();
				return true;
			};
			$("input, select").not("input#q_39_0").change(changecolor);
			$("input, select").not("input#q_39_0").click(changecolor);
			$("input, select").not("input#q_39_0").select(changecolor);
			$("input, select").not("input#q_39_0").keydown(changecolor);
			$("input, select").not("input#q_39_0").keypress(changecolor);
			$("input, select").not("input#q_39_0").keyup(changecolor);
			$("input, select").not("input#q_39_0").each(function(){
				return changecolor(this);
			});
			$("input#q_39_0").keyup(function(e) {
				if (e.keyCode == 27) { 
					$(this).val("");
					$("#q_39_1").children().not(".template").remove();
				}
			}).keypress(function(event){
				if ( event.which == 13 ) {
					event.preventDefault();
				}
			}).on("propertychange input",function(ev){
				apply39find(this);
			}).on("input",function(){
				apply39find(this);
			});
		});
		function increase(obj){
			if(obj.parent().find("input").val().length==0)
				obj.parent().find("input").val(0);
			else
				obj.parent().find("input").val(parseInt(obj.parent().find("input").val())+1);
			$(obj.parent().find("input")).removeClass("empty");
			return false;
		}
		function decrease(obj){
			if(obj.parent().find("input").val().length==0)
				obj.parent().find("input").val(0);
			else
				obj.parent().find("input").val(parseInt(obj.parent().find("input").val())-1);
			$(obj.parent().find("input")).removeClass("empty");
			return false;
		}
		function toggleText(obj){
			if(obj.val() == 0){
				obj.val(1);
				obj.text("[使用]");
				obj.css("font-weight", "bold");
			}else{
				obj.val(0);
				obj.text("[未使用]");
				obj.css("font-weight", "normal");
			}
		}
		function addCard(color, colorName, index){
			var card=$("#card_form").html();
			selection = colorName + " " + index;
			card = card.replace("###1", selection);
			card = $(card);
			card.css("background",color);
			$("#floor2_cards").append(card);
			return false;
		}
				
		function go(k){
			var loc = "".concat("player"+k);
			document.getElementById(loc).play();
        }
		
		function stopgo(k){
			var loc = "".concat("player"+k);
			document.getElementById(loc).pause();
		}
		
		function clear36(){
			if(confirm("確定要清除?")){
									$("input[name='q_36_1_1']").prop("checked",false).parent().addClass("empty");
					$("#q_36_disp_1").text("");
									$("input[name='q_36_1_2']").prop("checked",false).parent().addClass("empty");
					$("#q_36_disp_2").text("");
									$("input[name='q_36_1_3']").prop("checked",false).parent().addClass("empty");
					$("#q_36_disp_3").text("");
									$("input[name='q_36_1_4']").prop("checked",false).parent().addClass("empty");
					$("#q_36_disp_4").text("");
									$("input[name='q_36_1_5']").prop("checked",false).parent().addClass("empty");
					$("#q_36_disp_5").text("");
									$("input[name='q_36_1_6']").prop("checked",false).parent().addClass("empty");
					$("#q_36_disp_6").text("");
									$("input[name='q_36_1_7']").prop("checked",false).parent().addClass("empty");
					$("#q_36_disp_7").text("");
									$("input[name='q_36_1_8']").prop("checked",false).parent().addClass("empty");
					$("#q_36_disp_8").text("");
								$("#q_36_1").val("????????????").addClass("empty");
			}
		}
		$(function(){
			window.onbeforeunload = function(e) { return '確定要關閉?'; };
		});